package com.example.shayri_app;

import androidx.appcompat.app.AppCompatActivity;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;
import android.widget.AdapterView;
import android.widget.ImageView;
import android.widget.ListView;

public class MainActivity2 extends AppCompatActivity
{
    ListView getListView;
    String loveshayri[]={"मैं बन जाऊं रेत सनम, "+"\n" +
            "तुम लहर बन जाना…" +"\n"+
            "भरना मुझे अपनी बाहों में " +"\n"+
            "अपने संग ले जाना..!!",
            "मोहब्बत की कहूँ देवी या तुमको बंदगी कह दूँ,"+"\n" +
            "बुरा मानो न गर हमदम तो तुमको ज़िन्दगी कह दूँ।❤",
            "अच्छा लगता हैं तेरा नाम मेरे नाम के साथ," +"\n"+
                    "जैसे कोई खूबसूरत जगह हो हसीन शाम के साथ।",
            "जी चाहे कि दुनिया की हर एक फ़िक्र भुला कर," +"\n"+
                    "दिल की बातें सुनाऊं तुझे मैं पास बिठाकर।",
            "जी चाहे कि दुनिया की हर एक फ़िक्र भुला कर,"+"\n" +
                    "दिल की बातें सुनाऊं तुझे मैं पास बिठाकर।",
            "ये लकीरें ये नसीब ये किस्मत,सब फ़रेब के आईने हैं," +"\n"+
                    "हाथों में तेरा हाथ होने से ही,मुकम्मल ज़िन्दगी के मायने हैं।",
            "जब तलक तेरा सहारा है मुझे," +"\n"+
                    "गहरा पानी भी किनारा है मुझे,"+"\n" +
                    "ना भी चमके तो कोई बात नही,"+"\n" +
                    "तू तो वैसे भी सितारा है मुझे।",
            "मुसाफर इश्क़ का हूं मैंमेरी मंज़िल मुहब्बत है,"+"\n" +
                    "तेरे दिल में ठहर जाऊंअगर तेरी इजाज़त है।",
            "कर दे नजरे करम मुझ पर,"+"\n" +
                    "मैं तुझपे ऐतबार कर दूं," +"\n"+
                    "दीवाना हूं तेरा ऐसा," +"\n"+
                    "कि दीवानगी की हद को पार कर दूं।",
            "मिल जाओ ऐसे जैसे अंधेरे से उजाले, " +"\n"+
                    "में सवेरा हो जाऊं," +"\n"+
                    "बस जाओ मुझ में रूह बन कर," +"\n"+
                    " में सुनहरा हो जाऊं।।",
            "मेरी इबादत का कोई वक्त,मुकर्रर नही होता…"+"\n" +
                    "तुम ख्यालों में आते हो.." +"\n"+
                    "हम सजदे में बैठ जाते हैं..!!!",
            "अल्फाज़ की शक्ल में एहसास लिखा जाता है," +"\n"+
                    "यहाँ पर पानी को प्यास लिखा जाता है," +"\n"+
                    "मेरे जज़्बात से वाकिफ है मेरी कलम भी,"+"\n"+
                    "प्यार लिखूं तो तेरा नाम लिखाजाता है।"};
    String god[]={
            "ईश्वर पर आप तभी विश्वास कर सकते हैं," +"\n"+
                    "जब आपको खुद पर विश्वास हो "+"\n" +
                    "क्योकिईश्वर बाहर नही हमारे अंदर ही हैं!!",
            "कामयाबी के दरवाजे उन्हीं के लिए खुलते हैं," +"\n"+
                    "जो उन्हें खटखटाने की ताकत रखते हैं…!!",
            "मुझे अपने आप में कुछ यु बसा लो,"+"\n" +
                    "के ना रहू जुदा तुमसे और खुद से तुम हो जाऊ!",
            "मैं किसी से बेहतर करुं क्या फर्क पड़ता है..!"+"\n" +
                    "मै किसी का बेहतर करूं बहुत फर्क पड़ता है..!!",
            "कहने की जरूरत नही, " +"\n"+
                    "आना ही बहुत हैं,"+"\n" +
                    "शिव भक्ति में तेरा शीश झुकाना ही बहुत हैं!!",
            "जब ईश्वर मनुष्य की परीक्षा लेते हैं," +"\n"+
                    "तब वो मनुष्य का सामर्थ्य भी बढ़ा देते हैं," +"\n"+
                    "ताकि वो अधिक बुद्धिमान और अधिक ताकतवर बनें!!",
            "श्रद्धा का मतलब हैं आत्मविश्वास,"+"\n" +
                    "और आत्मविश्वास का मतलब हैं ईश्वर में विश्वास!",
            "भगवान बोलते है…तू करता वही है, " +"\n"+
                    "जो तू चाहता है!पर होता वही है जो मैं चाहता हूँ," +"\n"+
                    "तू वही कर जो मैं चाहता हूँ,"+"\n" +
                    "फिर होगा वही जो तू चाहता है…!",
            "हे प्रभु! मेरी प्रार्थना को ऐसे स्वीकार करो,"+"\n" +
                    "की जब-जब मेरा सिर झुके,"+"\n"+
                    "मुझसे जुड़े हर इंसान की जिंदगी सँवर जाए!!",
            "तेरा हाथ सिर पे होने सेमेरे सब काम साकार होते हैं," +"\n"+
                    "मैं जहाँ भी देखता हूँ तुझे मेरे मोहनमुझे तो बस तेरे दीदार होते हैं।",
            "शायद मेरे पास सब कुछ नहींपर ईश्वर ने मुझे वो सब दिया है,"+"\n" +
                    "जिसकी मुझे जरुरत है।मैं इसके लिए ईश्वर का आभारी हूँ।",
            "उसके होते हुए तू क्यों परेशान है,"+"\n" +
                    "भगवान के चरणों में तो हर समस्या का समाधान है।",};
            String friend[]={
    "यार हर मुखड़े की चमकान होती है, " +"\n"+
            "यारी ही सुख-दुःख की पहचान होती है," +"\n"+
            " कोई रूठ भी जाये तो दिल पे मत लेना,"+"\n" +
            "क्योंकि दोस्ती जरा-सी नादान होती है.",
            "ताज़ी हवा में फूलों की महक हो,"+"\n" +
                    "पहली किरण में चिड़ियो की चहक हो," +"\n"+
                    "जब भी आप अपनी पल्खें खोलो,"+"\n" +
                    "उन पलखो में खुशियों की झलक हो.",
            "जब दोस्ती सच्ची और मजबूत होती है,"+"\n" +
                    "तो उसे जताने की ज़रूरत नही होती है,"+"\n" +
                    "चाहे दोस्त कितना भी दूर चला जाये," +"\n"+
                    "उसे पास लाने की ज़रूरत नही होती है.",
            "उनकी दोस्ती का हर लम्हा बहुत खूबसूरत है," +"\n"+
                    "दोस्ती में यादों का सिलसिला बहुत खूबसूरत है,"+"\n" +
                    "वो हमे हमेशा तन्हाइयो में याद आया करते है,"+"\n" +
                    "इसलिये तन्हाइयां हमे महफ़िलो से भी ज़्यादा खूबसूरत हैं.",
            "सफर है दोस्ती का," +"\n"+
                    "जिसका कभी अंत नही होता," +"\n"+
                    "दोस्ती है हमारी सबसे प्यारी,"+"\n" +
                    "जो कभी खत्म नहीं होता.",
            "आँखों से आँसू क्यों छलक जाते है,"+"\n" +
                    "तन्हाइयों में गम क्यों याद आते है,"+"\n" +
                    "आँसू पोछ कर कोई ये बता दे हमसे,"+"\n" +
                    "दूर रहने वाले अक्सर क्यों याद आते है.",
            "ज़िन्दगी के सारे गम क्यों बाँट लेते हैं दोस्त," +"\n"+
                    "क्यों ज़िन्दगी में साथ देते हैं दोस्त,"+"\n" +
                    "रिश्ता तो सिर्फ उनसे दिल का होता है जी," +"\n"+
                    "फिर भी क्यों हमे अपना मान लेते हैं दोस्त.",
            "आपकी दोस्ती को दिल में बसा कर रखते हैं," +"\n"+
                    "आपकी मुस्कान को आँखों में सजा कर रखते है," +"\n"+
                    "हम कभी आपको भुला नही सकते है,"+"\n" +
                    "इसलिए आपकी यादों को सासों में दबा कर रखते हैं.",
            "ये दिन यू ही गुज़र जायँगे," +"\n"+
                    "हम दोस्त एक दिन बिछड़ जायँगे," +"\n"+
                    "आप नाराज़ ना होना मेरी शरारत से,"+"\n" +
                    "एक दिन ये पल याद आयगे.",
            "अच्छा और सच्चा दोस्त एक फूल है," +"\n"+
                    "जिसे हम तोड़ भी नही सकते,"+"\n" +
                    "और अकेला छोड़ भी नही सकते," +"\n"+
                    "अगर तोड़ लिया तो मुरझा जायेगा,"+"\n" +
                    "और छोड़ दिया तो कोई और ले जायेगा.",
            "हम से भी अच्छा कोई दोस्त बना कर देखना,"+"\n" +
                    "एक बार तुम ज़रा ये आज़मा कर देखना," +"\n"+
                    "फिर हम दोनों की दोस्ती में फर्क तू देखना,"+"\n" +
                    "फिर एक बार हमारी यादों में खो कर देखना.",
            "दिल से निकली बात दिल को छू जाती है,"+"\n" +
                    "ये अक्सर अनोखी बात रह जाती है," +"\n"+
                    "कुछ लोग दोस्ती के मायने बदल देते है," +"\n"+
                    "पर किसी की दोस्ती से दुनिया बदल जाती है.",
};
    String brother[]={
            " दिल के प्यार को कभी जताया नहीं, " +"\n"+
                    "भाई तू मेरी जान है तुझको कभी बताया नहीं।",
            "जब भाई-भाई में प्रेम पक्की होती है," +"\n"+
                    " तो घर की बड़ी ही तरक्की होती है.",
            "जब बड़ा भाई होता है साथ, " +"\n"+
                    "तो दुख का नहीं होता है एहसास।",
            "वक़्त के साथ भाई के रिश्ते बदल जाते हैं," +"\n"+
                    " अगर प्यार से सम्भालो तो संभल जाते हैं.",
            "भाई के रिश्ते का सबसे खूबसूरत गहना," +"\n"+
                    "बस जैसे आज हो, वैसे ही हमेशा रहना।",
            "भाई के रिश्ते का सबसे खूबसूरत गहना,"+"\n" +
                    "बस जैसे आज हो, वैसे ही हमेशा रहना।",
            " दिल के जज्बात बड़े हो जाते है," +"\n"+
                    "जब मुसीबत में भाई खड़े हो जाते हैं.",
            "शहर में ये कैसा हौवा है, " +"\n"+
                    "कुछ नहीं भाई कौवा है.",
            "भाई है तो थोड़ी सी लड़ाई भी है,"+"\n" +
                    "पर भाई की वजह से बहुत खुशियाँ पाई भी हैं",
            " जैसे दोनों आँख एक साथ होते हैं,"+"\n" +
                    "वैसे ही भाई-भाई के रिश्ते भी ख़ास होते हैं.",
            "जब भाई-भाई में लड़ाई हुई, "+"\n" +
                    "तब-तब सिर्फ जग हँसाई हुई.",
            "भाई मुझे सताता बहुत हैं," +"\n"+
                    "मुसीबत में अपनापन भी जताता बहुत हैं.",
    };
    String sadsayri[]={
            "अच्छे होते हैं वो लोग जो आकर चले जाते हैं,"+"\n" +
                    "थोड़ा ठहर कर जाने वाले बहुत रुलाते हैं !",
            "आँखें थक गई है आसमान को देखते देखतेपर वो तारा नहीं टूटता ,"+"\n" +
                    "जिसे देखकर तुम्हें मांग लूँ",
            "बात वफ़ा की होती तो कभी ना हारते,"+"\n" +
                    "बात नसीब की थी कुछ कर ना सके। ",
            "कुछ लोग मुझेअपना कहा करते थे साहब.. " +"\n"+
                    "!सच में वो लोग सिर्फ कहा ही करते थे !!",
            "बेशक जो जितना खामोश रहता है वो " +"\n"+
                    "अपनी इज़्ज़त उतनी ही महफूज़ रखता है.",
            "अच्छे होते हैं वो लोग जो आकर चले जाते हैं, "+"\n" +
                    "थोड़ा ठहर कर जाने वाले बहुत रुलाते हैं।",
            "मोहब्बत का दर्द दिल में छुपाया बहुत है," +"\n"+
                    "सच कहुँ उसकी मोहब्बत ने रुलाया बहुत है।",
            "कभी कभी नाराजगी,"+"\n" +
                    "दूसरों से ज्यादा खुद से होती है।",
            "मैंने कहा रंगो से इश्क़ है मुझे,"+"\n" +
                    "फिर जमाने ने हर रंग दिखाया मुझे।",
            "एक ये ख्वाहिश के कोई ज़ख्म न देखे दिल का," +"\n"+
                    "एक ये हसरत कि कोई देखने वाला तो होता।",
            "कोई आदत, कोई बात," +"\n"+
                    " या सिर्फ मेरी खामोशी,कभी तो,"+"\n" +
                    " कुछ तो,"+"\n" +
                    " उसे भी याद आता होगा।",
            "इक तेरे बगैर ही न गुजरेगी ये ज़िंदगी मेरी,"+"\n" +
                    "बता मैं क्या करूँ सारे ज़माने की ख़ुशी लेकर।"};
    String life[]={
            "जिसने भी मेरी किस्मत लिखी है अधूरी लिखी है," +"\n"+
                    " आजकल उसी को पूरा करने में लगा हुआ हूँ ",
            "इस दुनिया में खुद की मर्ज़ी से भी जीने के लिए, " +"\n"+
                    "पता नहीं कितनों को अर्ज़ी देनी पड़ती है",
            "अक्सर अपनो की ख़ुशी के चलते, "+"\n" +
                    "लोग ख्वाबों की खुद ख़ुशी कर देते है ",
            "गिरे हुए पैसों को तो सब उठाते है, " +"\n"+
                    "पता नहीं ये लोग अपना ईमान कब उठाएंगे II",
            "ज़िंदगी भी किताब सी होती है,"+"\n" +
                    " सब कुछ कह देती है खामोश रह के भी II",
            "आजकल मैं ज़िंदगी के बताये रास्तों पर चल रहा हूँ I",
            "कुछ तो आरज़ू रख, थोड़ा हौसला रख,"+"\n" +
                    " ज़िंदगी जीने का अपना तरीका रख II",
            "जो अपने आप को सरल रखता है, "+"\n" +
                    "वही सर्वोत्तम होता है",
            "आपकी पसंद ही आपकी मंज़िल तय करती है II",
            "रे समय में सही शख्स मिलना बहुत मुश्किल होता है I",
            "किसी को समझो या ना समझो," +"\n"+
                    " पर किसी को गलत मत समझो I",
            "इंसान सबसे ज्यादा ज़लील अपनी पसंद के लोगों के साथ ही होता है II"};
    String comedys[]={
            "मुस्कुराना तो हर लड़की की अदा है "+"\n" +
                    "जो इसे प्यार समझे वो सबसे बड़ा गधा है।",
            "ये मोहब्बत नहीं, उसूल-ए-वफ़ा है"+"\n" +
                    " ऐ दोस्त,हम जान तो दे देंगे "+"\n" +
                    "जान का नंबर नहीं देंगे।",
            " ना तलवार की धार से ना गोलियों की बौछार ,"+"\n" +
                    "बंदा डरता है तो सिर्फ अपने बाप की मार से।  ",
            "हम तुम्हारी याद में रो-रो के टब भर दिए," +"\n"+
                    "तुम इतने बेवफा निकले कि नहाकर चल दिए।",
            "मैं भी तेरे ईश्क में आतंकवादी बन जाऊं," +"\n"+
                    "तुझे बांहो में ले के बम से उड़ जाऊ 😛",
            "दिल दो किसी एक को और वो भी किसी नेक को," +"\n"+
                    "मंदिर का प्रसाद नहीं… जो बांट दो हर एक को।",
            "तुम्हारी बादशाह बनने की ख्वाइश ऐसी अलबेली हे की ," +"\n"+
                    "जेसे राजा भोज बने गंगू तेली ।",
            "अर्ज किया है…वो तुम्हें Dp दिखाकर गुमराह करेगी," +"\n"+
                    "मगर तुम आधार कार्ड पर अड़े रहना।",
            "री गलियों में ना रखेंगे कदम👨 आज के बाद," +"\n"+
                    "क्यूंकि हमारी 💏खुद की गली में हमारी 😂सेटिंग हो गई है !!✌",
            "अरे यारो वो गुस्से में भी हम पर रहम कर गई, " +"\n"+
                    "लगाया कस कर चाटा और सर्दी में भी गाल गर्म कर गई। 😆😅😆",
            "मैं इश्क विश्क के चक्कर में इसलिये भी नहीं पड़ता "+"\n" +
                    "के इतना सारा तोतला कौन बोलेगा? मेलाबाबू छोनाबाबू 😜😂😂😜",
            "जब होता है तुम्हारा दीदार, " +"\n"+
                    "दिल धड़कता है बार-बार, " +"\n"+
                    "आदत से मजबूर हो तुम, "+"\n" +
                    "न जाने कब मांग लो उधार😁😁"};
    String rajasthani[]={
            "दिल में प्यार है "+"\n"+
            "आंख्या में काजल है,"+"\n"+
            "ओ मारो राजस्थान है"+"\n"+
            "जगह-जगह मीठा फल है।",
        "रेगिस्तान में भी सुखी झाड़ियाँ भी हरी हो जाती है"+"\n"+
    "जब राजस्थान वाले किसी के साथ खड़े हो जाते है",
        "अंगरेजी म्हानै आवै कोनी,"+"\n"+
    "न हिंदी रौ घणौ ज्ञान,"+"\n"+
    "राजस्थान रा बाशिन्दा हां,"+"\n"+
    "राजस्थानी म्हारी पिछाण।।",
        "मेहनत करके एक दिने इतो ऊंचो पहुचणो है" +"\n"+
                " कि नीचू देखू तो धूझणी छूटने लागजे",
        "रामजी थाने सगळा ने निरोगा " +"\n"+
                "राखै कमाई दुनी चोगुणी बढ़ावे,"+"\n" +
                " टाबरिया आपस्यूं भी ऊँचा चढ़े घर आळी या "+"\n" +
                "घर आळा री मोकळी मेहरबानी रेवे।",
        "राजस्थान में अलग-अलग शहर वाले लोग की अलग ही पहचान है "+"\n"+
                "आधी राजस्थानी और आधी हरयाणवी कहने का मतलब सारी ही भाषा बोलते है",
        "बरसात आऊं आऊं करे,"+"\n" +
                " सरकार जाऊं जाऊं करे,"+"\n" +
                " कोरोना खाऊं खाऊं करे, "+"\n" +
                "सचिन कुछ पाऊं पाऊं करे, "+"\n" +
                "दूर बैठी मौसी म्याऊं म्याऊं करे।",
        "बातां प्यार सूं करां म्हे जरूरत पड़े तो लट्ठ गाड़ दा,"+"\n" +
                " शांति गा प्रतीक हों पण दुश्मनों के सिर फाड़ दा।",
        "ना हमे है टेंसन ना फिकर,"+"\n" +
                " जहाँ जयपुर जिलावाले खड़े होते है" +"\n"+
                " वहाँ matter हमेशा बड़े होते हैं" +"\n"+
                " वहाँ राजस्थानी भी खड़े होते हैं",
            "ओ पियाजी ,ओ ढोला म्हारा.." +"\n"+
                    " थानी याद घणी तड़पावे है," +"\n"+
                    "में तो सारी सारी रात जागु सूं राता में..",
        "चेतक पर चढ़ जिसने भाला से दुश्मन संघारे थे… "+"\n" +
                "मातृ भूमि के खातिर जंगल में कई साल गुजारे थे…",
        "रंगीलो राजस्थान शायरी जीमो बाजरे री रोटी और सांगरी रो साग, "+"\n" +
                "रंगीलो म्हारो राजस्थान बरसों सूं है हिवड़े हुं लाग।"};

    String rajniti[]={
            "जहाँ सच हैं, वहाँ पर हम खड़े हैं,"+"\n" +
                    "इसी खातिर आँखों में गड़े हैं.",
            "नेता की बातों में सच्चाई का अभाव होता है,"+"\n" +
                    "झूठ बोलना तो इनका स्वभाव होता हैं.",
            "नेता भी क्या खूब ठगते हैं," +"\n"+
                    "ये तो 5 साल बाद ही दिखते हैं.",
            "लोकतंत्र जब अपने असली रंग में आता हैं," +"\n"+
                    "तो नेताओं की औकात का पता चल जाता हैं.",
            "तुम से पहले वो जो इक शख़्स यहाँ तख़्त-नशीं था," +"\n"+
                    "उस को भी अपने ख़ुदा होने पे इतना ही यक़ीं था.",
            "गंदी राजनीति का यह भी एक परिणाम हैं," +"\n"+
                    "बीस रूपये एक बोतल पानी का दाम हैं.",
            "सवाल जहर का नहीं था, " +"\n"+
                    "वो तो मैं पी गया," +"\n"+
                    "तकलीफ लोगों को तब हुई, "+"\n" +
                    "जब मैं फिर भी जी गया.",
            "हमारी रहनुमाओ में भला इतना गुमां कैसे," +"\n"+
                    "हमारे जागने से, " +"\n"+
                    "नींद में उनकी खलल कैसे.",
            "इस नदी की धार में ठंडी हवा तो आती हैं,"+"\n" +
                    "नाव जर्जर ही सही, लहरों से टकराती तो हैं.",
            "कि जब इन नफ़रतों में ख़ुद तुम्हारा दम लगे घुटने,"+"\n" +
                    "तो आ जाना हमारी महफ़िलो में ज़िन्दगी जीने.",
            "मत सोचना मेरी जान से जुदा हैं तू," +"\n"+
                    "हकीकत में मेरे दिल का ख़ुदा हैं तू.",
            "ये जो हालत हैं ये सब तो सुधर जायेंगे,"+"\n" +
                    "पर कई लोग निगाहों से उतर जायेंगे…"};
    String yade[]={
            "मंज़िल दूर है माना मगर मैं भटका तो नहीं," +"\n"+
                    "इस सफर में यादें साथ है तेरी, मुसाफिर मैं तन्हा तो नहीं ।",
            "पलकों के सिरहाने कुछ ख्वाब दीवाने आगए,"+"\n" +
                    "तेरे लम्हों के दो-चार अफ़साने आगए। ",
            "तेरी याद में खो कर खुद को भूल जाते हैं,"+"\n" +
                    "हम अकसर तन्हाइयों में मुस्कुराते हैं ।",
            "रास्ते में तूने हमें पहचाना तो होगा," +"\n"+
                    "याद तुझे भी एक अफसाना तो होगा।",
            "तेरी यादों के पलकों पर,"+"\n" +
                    " हम रात गुज़ारा करते हैं तेरी जुल्फों की खुशबू में," +"\n"+
                    " हम नींद संवारा करते हैं|",
            "तुझसे बात करने की आरज़ू हुई है,"+"\n" +
                    "आज फिर दिल को तेरी जुस्तजू हुई है। ",
            "आज भी हाथ उठाया था,"+"\n"+
                    " तेरे ही वास्ते मुकम्मल ना सही, "+"\n" +
                    "मांग कर अच्छा लगता है ।",
            "बयां तुमसे नहीं करते तो और क्या करते," +"\n"+
                    "कैसे दिल लुटाते, "+"\n" +
                    "हम हसीन गुनाह करते।",
            "रफ्ता रफ्ता हमें ये शाम रुला जाती है,"+"\n" +
                    "इस जाम की हर बूंद, " +"\n"+
                    "तेरी याद दिला जाती है ।",
            "ऐसा आशिक़ कोई रहा ना होगा,"+"\n" +
                    "यादों का जिसका आशियाँ ना होगा।",
            "दूर है ज़िन्दगी का सफर अभी,"+"\n" +
                    "मुमकिन है के यादों का कारवां लेकर चलें।",
            "दिल को बस एक बात सताती है,"+"\n" +
                    "रातों में ये यादें क्यों इतना रुलाती है।"};
    ListView listView;
    ImageView imageView;
    int i,image;
    Custome_adapter_2 customeAdapter2;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main2);
        listView=findViewById(R.id.Activity_2_list_view);
        i=getIntent().getIntExtra("i",0);

        image=getIntent().getIntExtra("image",0);

        if(i==0) {

            customeAdapter2 = new Custome_adapter_2(MainActivity2.this, loveshayri,image);

        }else if(i==1)
        {
            customeAdapter2=new Custome_adapter_2(MainActivity2.this,god, image);

        }
        else if(i==2)
        {
            customeAdapter2=new Custome_adapter_2(MainActivity2.this,friend, image);

        } else if (i==3)
        {
            customeAdapter2=new Custome_adapter_2(MainActivity2.this,brother, image);

        }
        else if (i==4)
        {
            customeAdapter2=new Custome_adapter_2(MainActivity2.this,sadsayri, image);

        }
        else if (i==5)
        {
            customeAdapter2=new Custome_adapter_2(MainActivity2.this,life, image);

        }

        else if (i==6)
        {
            customeAdapter2=new Custome_adapter_2(MainActivity2.this,comedys, image);

        }
        else if (i==7)
        {
            customeAdapter2=new Custome_adapter_2(MainActivity2.this,rajasthani, image);

        }
        else if (i==8)
        {
            customeAdapter2=new Custome_adapter_2(MainActivity2.this,rajniti, image);

        }
        else if (i==9)
        {
            customeAdapter2=new Custome_adapter_2(MainActivity2.this,yade, image);

        }

        listView.setAdapter(customeAdapter2);

    listView.setOnItemClickListener((adapterView, view, i1, l) -> {
        Intent intent = new Intent(MainActivity2.this,shayri_open.class);
        if(i==0) {
            intent.putExtra("shayri", loveshayri[i1]);
            intent.putExtra("i1",i1);
        } else if (i==1) {
            intent.putExtra("shayri", god[i1]);
            intent.putExtra("i1",i1);
        }
        else if (i==2) {
            intent.putExtra("shayri", friend[i1]);
            intent.putExtra("i1",i1);
        }
        else if (i==3) {
            intent.putExtra("shayri", brother[i1]);
            intent.putExtra("i1",i1);
        }
        else if (i==4) {
            intent.putExtra("shayri", sadsayri[i1]);
            intent.putExtra("i1",i1);
        }
        else if (i==5) {
            intent.putExtra("shayri", life[i1]);
            intent.putExtra("i1",i1);
        }
        else if (i==6) {
            intent.putExtra("shayri", comedys[i1]);
            intent.putExtra("i1",i1);
        } else if (i==7) {
            intent.putExtra("shayri", rajasthani[i1]);
            intent.putExtra("i1",i1);
        }
        else if (i==8) {
            intent.putExtra("shayri", rajniti[i1]);
            intent.putExtra("i1",i1);
        }
        else if (i==9) {
            intent.putExtra("shayri", yade[i1]);
            intent.putExtra("i1",i1);
        }


        startActivity(intent);
    });

    }

}